Repository: wliao78/AI-Wardrobe-Public
Catalog: AIWardrobe/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans, zh_hant

source: Voice input
de: Spracheingabe
es: Entrada de voz
fr: Saisie vocale
ja: 音声入力
zh_hans: 语音输入
zh_hant: 語音輸入

# stopVoice
source: Stop listening
de: Aufnahme beenden
es: Detener grabación
fr: Arrêter l’écoute
ja: 録音を停止
zh_hans: 停止录音
zh_hant: 停止錄音

# voiceListening
source: Listening… tap to stop
de: Aufnahme… zum Beenden tippen
es: Escuchando… toca para detener
fr: Écoute… touchez pour arrêter
ja: 録音中…タップで停止
zh_hans: 正在听，请点按停止
zh_hant: 正在聆聽，點按可停止

# speechPermission
source: Allow speech recognition in Settings, or continue typing.
de: Spracherkennung in Einstellungen erlauben oder weiter tippen.
es: Permite el reconocimiento de voz en Ajustes o escribe el texto.
fr: Autorisez la reconnaissance vocale dans Réglages, ou utilisez le clavier.
ja: 設定で音声認識を許可するか、文字で入力してください。
zh_hans: 请在系统设置中允许语音识别，或继续使用文字输入。
zh_hant: 請在系統設定中允許語音辨識，或繼續使用文字輸入。

# microphonePermission
source: Allow microphone access in Settings, or continue typing.
de: Mikrofon in Einstellungen erlauben oder weiter tippen.
es: Permite el micrófono en Ajustes o escribe el texto.
fr: Autorisez le microphone dans Réglages, ou utilisez le clavier.
ja: 設定でマイクを許可するか、文字で入力してください。
zh_hans: 请在系统设置中允许麦克风，或继续使用文字输入。
zh_hant: 請在系統設定中允許麥克風，或繼續使用文字輸入。

# microphoneUnavailable
source: No microphone input is available. Check your audio input and try again.
de: Kein Mikrofoneingang verfügbar. Audioeingang prüfen und erneut versuchen.
es: No hay entrada de micrófono. Comprueba la entrada de audio y reinténtalo.
fr: Aucun microphone disponible. Vérifiez l’entrée audio et réessayez.
ja: マイク入力を利用できません。音声入力を確認して再試行してください。
zh_hans: 当前没有可用的麦克风输入，请检查音频输入后重试。
zh_hant: 目前沒有可用的麥克風輸入，請檢查音訊輸入後重試。

# speechUnavailable
source: Speech recognition is unavailable. Try again or continue typing.
de: Spracherkennung nicht verfügbar. Erneut versuchen oder tippen.
es: Reconocimiento de voz no disponible. Reinténtalo o escribe el texto.
fr: Reconnaissance vocale indisponible. Réessayez ou utilisez le clavier.
ja: 音声認識を利用できません。再試行するか文字で入力してください。
zh_hans: 当前语音识别不可用，请重试或使用文字输入。
zh_hant: 目前語音辨識不可用，請重試或使用文字輸入。

# speechStartFailed
source: The microphone could not start. Check your audio device and try again.
de: Mikrofon konnte nicht starten. Audiogerät prüfen und erneut versuchen.
es: No se pudo iniciar el micrófono. Comprueba el dispositivo de audio y reinténtalo.
fr: Impossible de démarrer le microphone. Vérifiez l’appareil audio et réessayez.
ja: マイクを開始できません。音声機器を確認して再試行してください。
zh_hans: 麦克风启动失败，请检查音频设备后重试。
zh_hant: 麥克風啟動失敗，請檢查音訊裝置後重試。

# appName
source: AI My Wardrobe
de: KI-Kleiderschrank
es: Armario IA
fr: Garde-robe IA
ja: AIクローゼット
zh_hans: AI衣橱
zh_hant: AI衣櫥

source: Today
de: Heute
es: Hoy
fr: Aujourd’hui
ja: 今日
zh_hans: 今天
zh_hant: 今天

source: Closet
de: Kleiderschrank
es: Armario
fr: Garde-robe
ja: クローゼット
zh_hans: 衣橱
zh_hant: 衣櫥

source: Try on
de: Anprobe
es: Probar
fr: Essayage
ja: 試着
zh_hans: 试穿
zh_hant: 試穿

# profile
source: Me
de: Profil
es: Perfil
fr: Profil
ja: マイページ
zh_hans: 我的
zh_hant: 我的

source: Top
de: Oberteil
es: Parte superior
fr: Haut
ja: トップス
zh_hans: 上衣
zh_hant: 上衣

source: Bottom
de: Hose
es: Parte inferior
fr: Bas
ja: ボトムス
zh_hans: 下装
zh_hant: 下裝

source: Outerwear
de: Jacke
es: Abrigo
fr: Veste
ja: アウター
zh_hans: 外套
zh_hant: 外套

source: Shoes
de: Schuhe
es: Zapatos
fr: Chaussures
ja: 靴
zh_hans: 鞋
zh_hant: 鞋

source: Accessory
de: Accessoire
es: Accesorio
fr: Accessoire
ja: 小物
zh_hans: 配饰
zh_hant: 配飾

source: Notice
de: Hinweis
es: Aviso
fr: Information
ja: お知らせ
zh_hans: 提示
zh_hant: 提示

source: Done
de: Fertig
es: Listo
fr: Terminé
ja: 完了
zh_hans: 完成
zh_hant: 完成

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
zh_hans: 保存
zh_hant: 儲存

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
zh_hans: 删除
zh_hant: 刪除

# saveLook
source: Save
de: Merken
es: Guardar
fr: Favori
ja: 保存
zh_hans: 收藏
zh_hant: 收藏

# newLook
source: Refresh
de: Wechseln
es: Cambiar
fr: Changer
ja: 別のコーデ
zh_hans: 换一套
zh_hant: 換一套

source: AI image
de: KI-Bild
es: Imagen IA
fr: Image IA
ja: AI画像
zh_hans: AI效果图
zh_hant: AI效果圖

# enlarge
source: View full image
de: Bild vergrößern
es: Ampliar imagen
fr: Agrandir l’image
ja: 画像を拡大
zh_hans: 点击查看大图
zh_hant: 點擊查看大圖

# generating
source: Generating your image…
de: Bild wird erstellt…
es: Generando imagen…
fr: Création de l’image…
ja: 画像を生成中…
zh_hans: 正在生成效果图…
zh_hant: 正在生成效果圖…

# thinking
source: Styling your look…
de: Outfit wird zusammengestellt…
es: Preparando tu conjunto…
fr: Préparation de la tenue…
ja: コーデを考え中…
zh_hans: 正在搭配…
zh_hant: 正在搭配…

source: Office
de: Büro
es: Oficina
fr: Bureau
ja: オフィス
zh_hans: 通勤
zh_hant: 通勤

source: Weekend
de: Freizeit
es: Casual
ja: 休日
zh_hans: 休闲
zh_hant: 休閒

# outdoor
source: Outdoors
de: Outdoor
es: Aire libre
fr: Plein air
ja: アウトドア
zh_hans: 户外
zh_hant: 戶外

# demo
source: Demo clothing
de: Demo-Kleidung
es: Prenda de ejemplo
fr: Vêtement de démo
ja: デモアイテム
zh_hans: 演示服饰
zh_hant: 示範服飾

# emptyCloset
source: Add a photo to start your wardrobe.
de: Füge ein Foto hinzu, um deinen Kleiderschrank anzulegen.
es: Añade una foto para crear tu armario.
fr: Ajoutez une photo pour créer votre garde-robe.
ja: 写真を追加してクローゼットを作りましょう。
zh_hans: 添加衣物照片，建立你的衣橱。
zh_hant: 加入衣物照片，建立你的衣櫥。

# chatPlaceholder
source: Describe your occasion…
de: Was hast du heute vor?
es: Describe la ocasión…
fr: Décrivez votre occasion…
ja: 今日の予定を入力…
zh_hans: 说说今天的场合…
zh_hant: 說說今天的場合…

source: Send
de: Senden
es: Enviar
fr: Envoyer
ja: 送信
zh_hans: 发送
zh_hant: 傳送

source: Weather data
de: Wetterdaten
es: Datos meteorológicos
fr: Données météo
ja: 天気データ
zh_hans: 天气数据
zh_hant: 天氣資料

# weatherPrompt
source: Tap for local weather
de: Lokales Wetter abrufen
es: Consultar el tiempo
fr: Météo locale
ja: タップして天気を取得
zh_hans: 点此获取当地天气
zh_hant: 點此取得當地天氣

source: Weather unavailable
de: Wetter nicht verfügbar
es: Tiempo no disponible
fr: Météo indisponible
ja: 天気を取得できません
zh_hans: 天气暂不可用
zh_hant: 天氣暫不可用

# needOutfitItems
source: Add a top, bottoms and shoes to create a look.
de: Füge Oberteil, Hose und Schuhe hinzu.
es: Añade una parte superior, una inferior y zapatos.
fr: Ajoutez un haut, un bas et des chaussures.
ja: トップス、ボトムス、靴を追加してください。
zh_hans: 请先添加上衣、下装和鞋。
zh_hant: 請先加入上衣、下裝和鞋。

# offlineReply
source: Here is an offline outfit idea. Connect an AI provider in Me to interpret your requests.
de: Hier ist ein Offline-Outfit. Richte im Profil KI für individuelle Wünsche ein.
es: Aquí tienes una combinación sin conexión. Configura la IA en Perfil para interpretar tus peticiones.
fr: Voici une tenue hors ligne. Configurez l’IA dans Profil pour interpréter vos demandes.
ja: オフラインのコーデです。詳しいリクエストにはマイページでAIを設定してください。
zh_hans: 已为你生成离线搭配。可在“我的”接入AI，以理解具体要求。
zh_hant: 已產生離線搭配。可在「我的」接入AI，以理解具體要求。

source: Your look
de: Dein Outfit
es: Tu conjunto
fr: Votre tenue
ja: あなたのコーデ
zh_hans: 你的搭配
zh_hant: 你的搭配

# search
source: Search clothing
de: Kleidung suchen
es: Buscar prendas
fr: Rechercher
ja: アイテムを検索
zh_hans: 搜索衣物
zh_hant: 搜尋衣物

# addGarment
source: Add clothing
de: Kleidung hinzufügen
es: Añadir prenda
fr: Ajouter un vêtement
ja: アイテムを追加
zh_hans: 添加衣物
zh_hant: 加入衣物

# garmentDetails
source: Clothing details
de: Kleidungsdetails
es: Detalles de la prenda
fr: Détails du vêtement
ja: アイテムの詳細
zh_hans: 衣物详情
zh_hant: 衣物詳情

# processing
source: Processing photo…
de: Foto wird verarbeitet…
es: Procesando foto…
fr: Traitement de la photo…
ja: 写真を処理中…
zh_hans: 正在处理图片…
zh_hant: 正在處理圖片…

source: Category
de: Kategorie
es: Categoría
fr: Catégorie
ja: カテゴリ
zh_hans: 类别
zh_hant: 類別

source: Color
de: Farbe
fr: Couleur
ja: 色
zh_hans: 颜色
zh_hant: 顏色

# deleteGarment
source: Delete this item?
de: Dieses Kleidungsstück löschen?
es: ¿Eliminar esta prenda?
fr: Supprimer ce vêtement ?
ja: このアイテムを削除しますか？
zh_hans: 删除这件衣物？
zh_hant: 刪除這件衣物？

# choosePhoto
source: Photos
de: Fotos
es: Fotos
ja: 写真を選択
zh_hans: 选照片
zh_hant: 選照片

source: Camera
de: Kamera
es: Cámara
fr: Appareil photo
ja: 撮影
zh_hans: 拍照
zh_hant: 拍照

# cameraUnavailable
source: Camera is unavailable on this device.
de: Die Kamera ist nicht verfügbar.
es: La cámara no está disponible.
fr: La caméra n’est pas disponible.
ja: このデバイスではカメラを使えません。
zh_hans: 此设备没有可用相机。
zh_hant: 此裝置沒有可用相機。

# cameraPermission
source: Allow camera access in iPhone Settings to take a photo.
de: Erlaube den Kamerazugriff in den iPhone-Einstellungen.
es: Permite el acceso a la cámara en Ajustes del iPhone.
fr: Autorisez la caméra dans les réglages de l’iPhone.
ja: iPhoneの設定でカメラへのアクセスを許可してください。
zh_hans: 请在iPhone设置中允许相机权限。
zh_hant: 請在iPhone設定中允許相機權限。

# photoError
source: This photo could not be opened. Please try another.
de: Dieses Foto konnte nicht geöffnet werden.
es: No se pudo abrir esta foto.
fr: Impossible d’ouvrir cette photo.
ja: 写真を開けません。別の写真をお試しください。
zh_hans: 无法读取照片，请换一张。
zh_hant: 無法讀取照片，請換一張。

source: Add to closet
de: Hinzufügen
es: Añadir
fr: Ajouter
ja: 追加
zh_hans: 加入衣橱
zh_hant: 加入衣櫥

# tryOnDisclaimer
source: AI images are visual approximations, not a fit or size guarantee. Until generated, the default model is shown.
de: KI-Bilder sind unverbindliche Ansichten ohne Größen- oder Passformgarantie. Bis zur Erstellung erscheint das Standardmodell.
es: Las imágenes IA son orientativas y no garantizan talla ni ajuste. Antes de generarlas se muestra el modelo predeterminado.
fr: Les images IA sont indicatives et ne garantissent pas la taille. Le mannequin par défaut apparaît avant la génération.
ja: AI画像は参考イメージです。サイズやフィット感を保証しません。生成前は既定モデルを表示します。
zh_hans: AI效果图仅供参考，不保证实际合身或尺码。生成前显示默认模特。
zh_hant: AI效果圖僅供參考，不保證實際合身或尺寸。產生前顯示預設模特。

# added
source: Added to your closet.
de: Zum Kleiderschrank hinzugefügt.
es: Añadido a tu armario.
fr: Ajouté à votre garde-robe.
ja: 追加しました。
zh_hans: 已加入衣橱。
zh_hant: 已加入衣櫥。

# defaultModel
source: Default AI model
de: Standard-KI-Modell
es: Modelo IA predeterminado
fr: Mannequin IA par défaut
ja: 既定のAIモデル
zh_hans: 默认AI模特
zh_hant: 預設AI模特

# personalModel
source: Your photo
de: Dein Foto
es: Tu foto
fr: Votre photo
ja: あなたの写真
zh_hans: 个人形象
zh_hant: 個人形象

# publicEdition
source: Public edition · 1.0
de: Öffentliche Version · 1.0
es: Edición pública · 1.0
fr: Édition publique · 1.0
ja: 公開版 · 1.0
zh_hans: 公开版 · 1.0
zh_hant: 公開版 · 1.0

# gender
source: Model
de: Modell
es: Modelo
fr: Mannequin
ja: モデル
zh_hans: 模特
zh_hant: 模特

source: Male
de: Männlich
es: Masculino
fr: Homme
ja: 男性
zh_hans: 男
zh_hant: 男

source: Female
de: Weiblich
es: Femenino
fr: Femme
ja: 女性
zh_hans: 女
zh_hant: 女

source: Model region
de: Modellregion
es: Región del modelo
fr: Région du mannequin
ja: モデルの地域
zh_hans: 模特地区
zh_hant: 模特地區

# region-auto
source: Automatic
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
zh_hans: 跟随手机
zh_hant: 跟隨手機

# region-us
source: United States
de: USA
es: Estados Unidos
fr: États-Unis
ja: アメリカ
zh_hans: 美国
zh_hant: 美國

# region-gb
source: United Kingdom
de: Großbritannien
es: Reino Unido
fr: Royaume-Uni
ja: イギリス
zh_hans: 英国
zh_hant: 英國

# region-fr
source: France
de: Frankreich
es: Francia
ja: フランス
zh_hans: 法国
zh_hant: 法國

# region-de
source: Germany
de: Deutschland
es: Alemania
fr: Allemagne
ja: ドイツ
zh_hans: 德国
zh_hant: 德國

# region-es
source: Spain
de: Spanien
es: España
fr: Espagne
ja: スペイン
zh_hans: 西班牙
zh_hant: 西班牙

# localeNote
source: Language, units and default models follow your iPhone settings. Models are fictional examples; you can choose any region.
de: Sprache, Einheiten und Modelle folgen den iPhone-Einstellungen. Die Modelle sind fiktiv; jede Region ist frei wählbar.
es: El idioma, las unidades y los modelos siguen al iPhone. Los modelos son ficticios; puedes elegir cualquier región.
fr: La langue, les unités et les mannequins suivent l’iPhone. Les mannequins sont fictifs ; choisissez librement une région.
ja: 言語・単位・モデルはiPhoneの設定に従います。モデルは架空で、地域は自由に選べます。
zh_hans: 语言、单位及默认模特跟随手机设置。模特为虚构示例，可自由选择地区。
zh_hant: 語言、單位及預設模特跟隨手機設定。模特為虛構示例，可自由選擇地區。

# bodyPhotos
source: Body reference photos
de: Referenzfotos
es: Fotos de referencia
fr: Photos de référence
ja: 全身の参考写真
zh_hans: 个人四面照
zh_hant: 個人四面照

# bodyPhotoNote
source: Optional. Add front, left, right and back photos to use your own appearance. Stored on this iPhone; shared only with explicit AI photo consent.
de: Optional: Füge Vorder-, Seiten- und Rückansichten hinzu. Fotos bleiben auf dem iPhone und werden nur mit ausdrücklicher Zustimmung an KI gesendet.
es: Opcional. Añade las cuatro vistas para usar tu apariencia. Las fotos se guardan en el iPhone y solo se envían a la IA con tu permiso.
fr: Facultatif. Ajoutez les quatre vues pour utiliser votre apparence. Photos locales, envoyées à l’IA uniquement avec votre accord.
ja: 任意です。前・左・右・後ろの写真を追加すると自分の姿を使えます。端末に保存し、明示的な同意後のみAIに送信します。
zh_hans: 可选。上传正面、左侧、右侧和背面照后使用个人形象。照片保存在本机，仅在明确同意AI图片处理后发送。
zh_hant: 可選。上傳正面、左側、右側和背面照後使用個人形象。照片保存在本機，僅在明確同意AI圖片處理後傳送。

source: Front
de: Vorne
es: Frente
fr: Face
ja: 正面
zh_hans: 正面
zh_hant: 正面

source: Left
de: Links
es: Izquierda
fr: Gauche
ja: 左側
zh_hans: 左侧
zh_hant: 左側

source: Right
de: Rechts
es: Derecha
fr: Droite
ja: 右側
zh_hans: 右侧
zh_hant: 右側

source: Back
de: Hinten
es: Espalda
fr: Dos
ja: 背面
zh_hans: 背面
zh_hant: 背面

# removeBodyPhotos
source: Delete body photos
de: Referenzfotos löschen
es: Eliminar fotos personales
fr: Supprimer les photos
ja: 参考写真を削除
zh_hans: 删除个人照片
zh_hant: 刪除個人照片

source: AI settings
de: KI-Einstellungen
es: Ajustes de IA
fr: Réglages IA
ja: AI設定
zh_hans: AI设置
zh_hant: AI設定

source: Saved looks
de: Gespeicherte Outfits
es: Conjuntos guardados
fr: Tenues enregistrées
ja: 保存したコーデ
zh_hans: 收藏搭配
zh_hant: 收藏搭配

# restoreDemo
source: Add demo wardrobe
de: Demo hinzufügen
es: Añadir ejemplos
fr: Ajouter la démo
ja: デモを追加
zh_hans: 添加演示服饰
zh_hant: 加入示範服飾

# privacy
source: Privacy & data
de: Datenschutz
es: Privacidad
fr: Confidentialité
ja: プライバシーとデータ
zh_hans: 隐私与数据
zh_hant: 隱私與資料

source: Privacy policy
de: Datenschutzerklärung
es: Política de privacidad
fr: Politique de confidentialité
ja: プライバシーポリシー
zh_hans: 隐私政策
zh_hant: 隱私政策

# terms
source: Terms of use
de: Nutzungsbedingungen
es: Condiciones de uso
fr: Conditions d’utilisation
ja: 利用規約
zh_hans: 使用条款
zh_hant: 使用條款

# deleteAll
source: Delete all local data
de: Alle lokalen Daten löschen
es: Eliminar todos los datos locales
fr: Supprimer les données locales
ja: 端末の全データを削除
zh_hans: 删除所有本机数据
zh_hant: 刪除所有本機資料

# deleteAllWarning
source: Deletes clothing, photos, looks, chats, settings and all saved API keys. This cannot be undone. Provider-held data must be managed with that provider.
de: Löscht Kleidung, Fotos, Outfits, Chats, Einstellungen und API-Schlüssel unwiderruflich. Bereits übermittelte Daten beim Anbieter verwalten.
es: Elimina prendas, fotos, conjuntos, chats, ajustes y claves API. No se puede deshacer. Gestiona los datos enviados con el proveedor.
fr: Supprime vêtements, photos, tenues, discussions, réglages et clés API. Irréversible. Gérez les données déjà envoyées auprès du prestataire.
ja: 衣服・写真・コーデ・会話・設定・APIキーを削除します。元に戻せません。送信済みデータは提供者に削除を依頼してください。
zh_hans: 将删除衣物、照片、搭配、对话、设置和所有API Key，无法撤销。服务商保留的数据需向其管理或申请删除。
zh_hant: 將刪除衣物、照片、搭配、對話、設定和所有API Key，無法復原。服務商保留的資料需向其管理或申請刪除。

# localStorageNote
source: No account, ads or tracking. Your wardrobe stays on this iPhone. No cloud sync or app-data backup in this edition.
de: Ohne Konto, Werbung oder Tracking. Daten bleiben auf diesem iPhone, ohne Cloud-Sync oder App-Datensicherung.
es: Sin cuenta, anuncios ni rastreo. Datos en este iPhone, sin sincronización ni copia de seguridad de la app.
fr: Sans compte, publicité ni suivi. Données sur cet iPhone, sans synchronisation ni sauvegarde de l’app.
ja: アカウント・広告・追跡なし。データはこのiPhoneに保存。クラウド同期・アプリデータのバックアップはありません。
zh_hans: 无需账号，无广告和跟踪。衣橱保存在此iPhone，本版不提供云同步或应用数据备份。
zh_hant: 無需帳號，無廣告和追蹤。衣櫥保存在此iPhone，本版不提供雲端同步或應用資料備份。

# provider
source: AI provider
de: KI-Anbieter
es: Proveedor de IA
fr: Fournisseur IA
ja: AI提供者
zh_hans: AI服务商
zh_hant: AI服務商

# customProvider
source: Custom (OpenAI compatible)
de: Eigener Anbieter (OpenAI-kompatibel)
es: Personalizado (compatible con OpenAI)
fr: Personnalisé (compatible OpenAI)
ja: カスタム（OpenAI互換）
zh_hans: 自定义（OpenAI兼容）
zh_hant: 自訂（OpenAI相容）

# model
source: Text model
de: Textmodell
es: Modelo de texto
fr: Modèle de texte
ja: テキストモデル
zh_hans: 文字模型
zh_hant: 文字模型

source: Image model
de: Bildmodell
es: Modelo de imagen
fr: Modèle d’image
ja: 画像モデル
zh_hans: 图片模型
zh_hant: 圖片模型

source: Test connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
ja: 接続テスト
zh_hans: 测试连接
zh_hant: 測試連線

# apiCostNote
source: Optional: bring your own API key. Provider charges may apply, including a small connection test. This app does not sell API access.
de: Optionaler eigener API-Schlüssel. Der Anbieter kann Anfragen und Tests berechnen. Die App verkauft keinen API-Zugang.
es: Clave API propia opcional. El proveedor puede cobrar consultas y pruebas. La app no vende acceso a API.
fr: Clé API personnelle facultative. Le prestataire peut facturer les requêtes et le test. L’app ne vend pas d’accès API.
ja: 任意のAPIキーを設定できます。接続テストを含め提供者の料金が発生する場合があります。本アプリはAPIアクセスを販売しません。
zh_hans: 可选：使用自己的API Key。服务商可能收费，连接测试也可能产生少量费用。本应用不销售API访问权限。
zh_hant: 可選：使用自己的API Key。服務商可能收費，連線測試也可能產生少量費用。本應用不銷售API存取權限。

# dataConsent
source: Data sharing permission
de: Datenfreigabe
es: Permiso para compartir datos
fr: Autorisation de partage
ja: データ送信の許可
zh_hans: 数据发送授权
zh_hant: 資料傳送授權

# textConsentDetails
source: For outfit advice, the selected provider receives clothing names, categories, colors, your recent messages, app language and temperature (not coordinates). Your API key authenticates requests directly with that provider.
de: Der Anbieter erhält Kleidungsnamen, Kategorien, Farben, letzte Nachrichten, Sprache und Temperatur, keine Koordinaten. Der API-Schlüssel authentifiziert direkt beim Anbieter.
es: El proveedor recibe nombres, categorías y colores, mensajes recientes, idioma y temperatura, sin coordenadas. La clave autentica directamente con ese proveedor.
fr: Le prestataire reçoit noms, catégories et couleurs des vêtements, messages récents, langue et température, sans coordonnées. La clé sert à l’authentification directe.
ja: 提案には衣服名・種類・色・最近の会話・言語・気温（座標を除く）を選択した提供者に送ります。APIキーはその提供者への認証に使います。
zh_hans: 生成搭配建议时，所选服务商将收到衣物名称、类别、颜色、近期对话、应用语言和温度（不含坐标）。API Key仅用于向该服务商验证请求。
zh_hant: 產生搭配建議時，所選服務商將收到衣物名稱、類別、顏色、近期對話、應用語言和溫度（不含座標）。API Key僅用於向該服務商驗證請求。

# allowText
source: Allow outfit data sharing
de: Outfit-Daten freigeben
es: Permitir datos de conjuntos
fr: Autoriser les données de tenue
ja: コーデデータの送信を許可
zh_hans: 允许发送搭配数据
zh_hant: 允許傳送搭配資料

# photoConsentDetails
source: When you tap AI image, the selected provider also receives the chosen model or your front photo and selected clothing photos. Images may contain your face and body. Retention and processing follow that provider’s policy.
de: Bei KI-Bild werden zusätzlich Modell- oder eigenes Vorderfoto und Kleidungsfotos gesendet. Gesicht und Körper können sichtbar sein. Speicherung gemäß Anbieterrichtlinie.
es: Al pulsar Imagen IA se envían el modelo o tu foto frontal y las prendas elegidas. Pueden incluir rostro y cuerpo. La conservación depende del proveedor.
fr: En touchant Image IA, vous envoyez aussi le mannequin ou votre photo de face et les vêtements sélectionnés. Visage et corps peuvent être visibles. Conservation selon le prestataire.
ja: AI画像を押すとモデル画像または自分の正面写真と衣服写真を送信します。顔や身体が含まれる場合があります。保存期間は提供者の方針に従います。
zh_hans: 点击AI效果图时，所选服务商还将收到模特图或你的正面照，以及所选衣物照片。图片可能包含面部与身体；处理及保留期限遵循该服务商政策。
zh_hant: 點擊AI效果圖時，所選服務商還將收到模特圖或你的正面照，以及所選衣物照片。圖片可能包含臉部與身體；處理及保留期限遵循該服務商政策。

# allowPhotos
source: Allow photo sharing for AI images
de: Fotos für KI-Bilder freigeben
es: Permitir fotos para imágenes IA
fr: Autoriser l’envoi des photos
ja: AI画像用の写真送信を許可
zh_hans: 允许发送照片生成AI图
zh_hant: 允許傳送照片產生AI圖

# providerPrivacy
source: Provider privacy policy
de: Datenschutz des Anbieters
es: Privacidad del proveedor
fr: Confidentialité du prestataire
ja: 提供者のプライバシーポリシー
zh_hans: 服务商隐私政策
zh_hant: 服務商隱私政策

# revokeNote
source: Optional and off by default. Save to apply. You can revoke permission at any time. Changing provider or endpoint requires fresh consent.
de: Optional und standardmäßig aus. Zum Anwenden speichern. Jederzeit widerrufbar. Anbieterwechsel erfordert neue Zustimmung.
es: Opcional y desactivado por defecto. Guarda para aplicar. Puedes revocarlo cuando quieras. Cambiar de proveedor requiere nuevo permiso.
fr: Facultatif et désactivé par défaut. Enregistrez pour appliquer. Révocable à tout moment. Un autre prestataire nécessite un nouvel accord.
ja: 任意で初期状態はオフ。保存して適用。いつでも撤回可能。提供者やURLの変更には再同意が必要です。
zh_hans: 可选，默认关闭。保存后生效，可随时撤销。更换服务商或地址需要重新授权。
zh_hant: 可選，預設關閉。儲存後生效，可隨時撤銷。更換服務商或網址需要重新授權。

# revokeConsent
source: Revoke AI permission
de: KI-Zustimmung widerrufen
es: Revocar permiso de IA
fr: Révoquer l’autorisation IA
ja: AIの許可を取り消す
zh_hans: 撤销AI授权
zh_hant: 撤銷AI授權

# consentRevoked
source: AI sharing permission revoked.
de: KI-Zustimmung widerrufen.
es: Permiso de IA revocado.
fr: Autorisation IA révoquée.
ja: AI送信の許可を取り消しました。
zh_hans: 已撤销AI数据发送授权。
zh_hant: 已撤銷AI資料傳送授權。

# deleteKey
source: Delete this API key
de: Diesen API-Schlüssel löschen
es: Eliminar esta clave API
fr: Supprimer cette clé API
ja: このAPIキーを削除
zh_hans: 删除此API Key
zh_hant: 刪除此API Key

source: Settings saved.
de: Einstellungen gespeichert.
es: Ajustes guardados.
fr: Réglages enregistrés.
ja: 設定を保存しました。
zh_hans: 设置已保存。
zh_hant: 設定已儲存。

# connectionOK
source: Connected. The model answered the test request.
de: Verbunden. Das Modell hat geantwortet.
es: Conexión correcta. El modelo respondió.
fr: Connexion réussie. Le modèle a répondu.
ja: 接続成功。モデルが応答しました。
zh_hans: 连接成功，模型已响应测试。
zh_hant: 連線成功，模型已回應測試。

# configureAI
source: Configure an API key, HTTPS endpoint and model in AI settings.
de: API-Schlüssel, HTTPS-Adresse und Modell in den KI-Einstellungen einrichten.
es: Configura clave API, dirección HTTPS y modelo.
fr: Configurez une clé API, une adresse HTTPS et un modèle.
ja: AI設定でキー・HTTPS URL・モデルを設定してください。
zh_hans: 请在AI设置中配置API Key、HTTPS地址和模型。
zh_hant: 請在AI設定中配置API Key、HTTPS網址和模型。

# needTextConsent
source: Allow data sharing in AI settings before using online recommendations.
de: Bitte Datenfreigabe in den KI-Einstellungen erlauben.
es: Permite compartir datos en los ajustes de IA.
fr: Autorisez le partage dans les réglages IA.
ja: AI設定でデータ送信を許可してください。
zh_hans: 请先在AI设置中同意发送搭配数据。
zh_hant: 請先在AI設定中同意傳送搭配資料。

# needPhotoConsent
source: Allow photo sharing in AI settings before generating an image.
de: Bitte Fotofreigabe in den KI-Einstellungen erlauben.
es: Permite compartir fotos en los ajustes de IA.
fr: Autorisez l’envoi des photos dans les réglages IA.
ja: AI設定で写真送信を許可してください。
zh_hans: 请先在AI设置中同意发送照片。
zh_hant: 請先在AI設定中同意傳送照片。

# invalidAIResponse
source: The AI response could not be used. Please try again.
de: Die KI-Antwort konnte nicht verwendet werden.
es: No se pudo usar la respuesta de IA.
fr: Réponse IA inutilisable. Réessayez.
ja: AIの応答を使用できません。再試行してください。
zh_hans: AI返回结果无法使用，请重试。
zh_hant: AI回傳結果無法使用，請重試。

# imageUnsupported
source: This provider supports text advice only. Use OpenAI or Google Gemini for AI images.
de: Dieser Anbieter unterstützt nur Text. Für KI-Bilder OpenAI oder Google Gemini wählen.
es: Este proveedor solo admite texto. Para imágenes usa OpenAI o Google Gemini.
fr: Ce prestataire propose le texte uniquement. Pour les images, utilisez OpenAI ou Google Gemini.
ja: この提供者はテキスト提案のみ対応。画像にはOpenAIかGoogle Geminiを選択してください。
zh_hans: 此服务商仅支持文字搭配建议。AI效果图请使用OpenAI或Google Gemini。
zh_hant: 此服務商僅支援文字搭配建議。AI效果圖請使用OpenAI或Google Gemini。
